Repository: wp-plugins/enforce-strong-password
Catalog: languages/enforce-strong-password-*.po
Languages: nl_nl

source: Enforce Strong Passwords Options
nl_nl: Forceer Sterk Wachtwoord instellingen

source: Enforce Strong Passwords
nl_nl: Forceer Sterk Wachtwoord

source: Options updated.
nl_nl: Instellingen bijgewerkt.

source: Options
nl_nl: Instellingen

source: Minimal required password strength
nl_nl: Minimaal vereiste wachtwoord sterkte

source: Larger value means stronger password. Recommended value is %s
nl_nl: Grotere waarde betekent een sterker wachtwoord. Aanbevolen waarde is %s

source: Hide donation button
nl_nl: Verberg Donatie knop

source: If you don't want to be bothered again...
nl_nl: Als u hier niet meer mee lastig gevallen wilt worden...

source: Please enter a %sstronger%s password to ensure your and this blog's security.
nl_nl: Voer s.v.p. een %ssterker%s wachtwoord in ten behoeve van de veiligheid van uw site.

source: Please consider a donation
nl_nl: Overweeg s.v.p. een donatie

source: I spend quite a lot of my precious time working on opensource WordPress plugins. If you find this one useful, please consider helping me develop it further. Even the smallest amount of money you are willing to spend will be welcome.
nl_nl: Ik stop veel kostbare tijd in het werken aan open source WordPress plugins. Als u deze plugin nuttig vindt, overweeg dan eens om me te steunen. Zelfs het kleinste bedrag dat u wilt schenken is welkom.

source: Enforce strong password
nl_nl: Forceer Sterk Wachtwoord

source: Forces all users to have a strong password when they're changing it on their profile page.
nl_nl: Forceert alle gebruikers een sterk wachtwoord te kiezen wanneer zij dit aanpassen op hun profielpagina.
